import pandas as pd


# 威秀：信義、板橋大遠百
column = ["電影院", "廳院", "全票", "優待票", "愛心票", "敬老票", "早場", "會員票"]
price = [
    ["信義威秀", "一般票價", "340", "320", "170", "170", "280", "280"],
    ["信義威秀", "數位3D票價", "410", "390", "205", "205", "350", "340"],
    ["信義威秀", "數位4DX票價", "540", "520", "270", "270", "480", "480"],
    ["信義威秀", "數位4DX 3D票價", "610", "590", "305", "305", "550", "540"],
    ["板橋大遠百威秀", "一般票價", "330", "310", "165", "165", "280", "280"],
    ["板橋大遠百威秀", "數位3D票價", "400", "380", "200", "200", "350", "340"],
    ["板橋大遠百威秀", "數位IMAX票價", "410", "390", "205" , "205", "360", "340"],
    ["板橋大遠百威秀", "數位IMAX 3D票價", "470", "450", "235", "235", "420", "400"]
    ]
viewShow = pd.DataFrame(price, columns = column)
viewShow.to_csv("威秀票價.csv")


# 國賓：西門、長春
column = ["影城", "廳院", "全票", "會員", "早場", "優待", "敬老", "特價優惠", "團體"]
price = [
    ["西門國賓鉅院", "數位2D", "400", "320", "330", "370", "200", "200", "320"],
    ["西門國賓鉅院", "數位3D", "470", "390", "400", "440", "235", "235", "390"],
    ["西門國賓鉅院", "D-BOX 2D", "560", "480", "500", "530", "360", "360", "480"],
    ["西門國賓鉅院", "D-BOX 3D", "630", "540", "570", "600", "395", "395", "540"],
    ["西門國賓鉅院", "數位2D", "400", "320", "330", "370", "200", "200", "320"],
    ["西門國賓2、3廳", "數位2D", "310", "240", "260", "280", "155", "155", "240"],
    ["西門國賓2、3廳", "數位2D", "380", "310", "330", "350", "190", "190", "310"],
    ["長春國賓", "數位2D", "320", "240", "280", "300", "160", "160", "230"],
    ["長春國賓", "數位3D", "380", "300", "360", "360", "190", "190", "300"]
    ]
ambassador = pd.DataFrame(price, columns = column)
ambassador.to_csv("國賓票價.csv")


# 喜滿客
column = ["影城", "廳院", "全票", "優待","早場", "愛心/敬老", "午夜優惠", "會員"]
price = [
    ["西門絕色", "2D", "270", "240", "200", "135", "200", "210"],
    ["西門絕色", "3D", "330", "300", "260", "165", "260", "270"]
    ]

cmk = pd.DataFrame(price, columns = column)
cmk.to_csv("喜滿客絕色票價.csv")


# 秀泰：欣欣、今日、東南亞、板橋
column = ["影城", "廳院", "全票", "優待", "早場", "愛心"]
price = [
    ["欣欣秀泰", "2D", "290", "250", "200", "145"],
    ["欣欣秀泰", "3D", "340", "310", "280", "170"],
    ["今日秀泰", "2D", "280", "240", "200", "140"],
    ["今日秀泰", "3D", "340", "300", "280", "170"],
    ["東南亞秀泰", "2D", "280", "240", "200", "140"],
    ["東南亞秀泰", "3D", "340", "300", "280", "170"],
    ["板橋秀泰", "2D", "290", "2460", "230", "145"],
    ["板橋秀泰", "3D", "350", "330", "290", "175"]
    ]
showtimes = pd.DataFrame(price, columns = column)
showtimes.to_csv("秀泰票價.csv")


# 誠品
column = ["影城","片長", "全票", "學生", "早場", "會員", "迷影卡", "愛心票", "敬老票", "組合餐"]
price = [
    ["誠品", "<150","290", "260", "240", "240", "200", "145", "145", "350"],
    ["誠品", ">=150","310", "280", "260", "260", "220", "155", "155", "370"]
    ]
eslite = pd.DataFrame(price, columns = column)
eslite.to_csv("誠品票價.csv")

print("finished")